[
    {
        "id": 1,
        "position": 1,
        "startAt": "04-01-2012",
        "endAt": "06-01-2014",
        "companyName": "Elance & Odesk",
        "website": "https://www.upwork.com/",
        "logo": "assets/template/experience/logo/elance-odesk-logo.png",
        "internationalizations": [
            {
                "language": "pt",
                "city": "Uberaba",
                "country": "Brasil",
                "role": "Estágio Webmaster",
                "description": "A <b>Fácil Tecnologias LTDA</b> é uma empresa focada em soluções para educação, seu principal produto é um conjunto de soluções para estudos na obtenção da <i>carteira nacional de habilitação (CNH)</i>, entre elas, multimídias, aplicativos on-line, aplicativos móveis, livros, entre outros. <br><br>Na <i>Fácil Tecnologias LTDA</i>, entrei em contato com desenvolvedores seniores, aprendendo as melhores práticas, padrões e como debater idéias e oferecer soluções diversas para o mesmo problema. Foi o ponto de partida, uma oportunidade única de transformar o conhecimento teórico em soluções concretas que estavam sendo usadas por centenas de pessoas todos os dias."
            },
            {
                "language": "en",
                "city": "Santa Clara and San Francisco",
                "country": "United States",
                "role": "Freelancer",
                "description": "- Developed (hands-on) full-stack web projects, distributed systems, and services.<br>- Conducted research for customer intelligence related to eCommerce and online marketing solutions for wellknown brands. <br>- Managed multiple projects and products driving them to a successful outcome."
            }
        ],
        "technologies": [
            "PHP", "Zend Framework", "HTML", "CSS", "CSS3", "Javascript", "jQuery", "AJAX", "SOAP", "Wordpress", "SVN", "SQL", "MySQL", "PostgreSQL", "Windows", "MacOS", "Android", "Java", "iOS", "cocos2d", "Unity3D", "CodeIgniter", "Node.js", "Linux", "Refactoring", "RESTful Services", "RESTful APIs", "Object-oriented Design (OOD)", "Object-oriented Programming (OOP)", "Automated Testing", "Jasmine", "Instruction & Coaching" 
        ],
        "medias1": [
            {
                "icon": "facebook",
                "title": "Facebook Editora Nosso Trânsito",
                "http": "https://www.facebook.com/editoranossotransito/"
            }
        ],
        "medias": [
            
        ],
        "backgroundUrl": "assets/template/experience/uberaba.jpg"
    },
    {
        "id": 2,
        "position": 2,
        "startAt": "08-01-2014",
        "endAt": "11-01-2018",
        "companyName": "Ranosys",
        "website": "https://www.ranosys.com/",
        "logo": "assets/template/experience/logo/ranosys-logo.png",
        "internationalizations": [
            {
                "language": "pt",
                "city": "Rio de Janeiro",
                "country": "Brasil",
                "role": "Desenvolvedor Full-stack",
                "description": "A <b>E-tática</b> é uma agência especializada em soluções para <i>comércio eletrônico</i>, marketing digital e identidade visual desde 2008, trabalhando com grandes, pequenos e médios negócios, oferecendo para seus clientes, o know-how na integração de seus negócios com <i>Sistemas integrados de gestão empresarial (ERP)</i> e <i>APIs de terceiros</i>, tais como <i>provedores de pagamento personalizados</i>, fazendo a integração do gerenciamento interno da plataforma on-line e da loja física, sendo certificada pelas principais plataformas do mercado.<br><br>Na <i>E-tática </i>, trabalhei para desenvolver soluções personalizadas para clientes do atacado e varejo, valorizando a qualidade e a continuidade dos projetos a médio e longo prazo."
            },
            {
                "language": "en",
                "city": "Singapore",
                "country": "Singapore",
                "role": "Software Developer",
                "description": "- Maintained a 100% 5-star rating in 12 projects.<br>- Developed company procedures and guidelines for data analysis and security that increased efficiency by 30% in the first 6 months after implementation.<br>- Participated in over 250 code reviews to ensure code quality and received mentoring from senior developers.<br>- Designed, built, and automated data flows to save 10+ hours of tedious work per week.<br>- Applied hands-on learning and agile development to build MEAN and MERN stack applications.<br>- Developed Unit and E2E test cases using Jasmine, Jest, Mocha and Grunt, Node.js.<br>- Solved difficult dataset problems using ideas from distributed computing, large-scale design, real-time data processing, data storage, artificial intelligence, and machine learning, saving 35% on maintenance costs.<br>- Redesigned and rebuilt over 20 companies’ websites and mobile apps, and resulted in remarkable growth for over 10 startup companies.<br>- Gained experience with various web development tools, including Bower, NPM, Git, Material Design, Gulp, and Cloud Services like AWS, Azure, GCP, Heroku and so on.<br>- Built a web-based WYSIWYG visual designer (Kococonnect) for mobile applications and embedded mobile experiences using React, React-Redux, and TypeScript.<br>- Devised and implemented the WYSIWYG Experience Editing Platform."
            }
        ],
        "technologies": [
            "AngularJS", "Apache Cordova", "Node.js", "WebRTC", "Ionic", "Wordpress", "SVN", "Payment Services", "SSH", "SSL", "Linux", "ASP.NET", "Microsoft Dynamics CRM", "Web API", "Bower", "Grunt", "Scrum", "React", "Office 365", "SpecFlow", "Selenium", "TypeScript", "AngularJS", "ASP.NET MVC", "Microsoft Azure", "React Native", "Android", "iOS"
        ],
        "medias":[],
        "medias1": [
            {
                "icon": "linkedin",
                "title": "LinkedIn E-tática",
                "http": "https://www.linkedin.com/company/etatica/"
            },
            {
                "icon": "facebook",
                "title": "Facebook E-tática",
                "http": "https://www.facebook.com/etatica/"
            },
            {
                "icon": "instagram",
                "title": "Instagram E-tática",
                "http": "https://www.instagram.com/somos_etatica/"
            }
        ],
        "backgroundUrl": "assets/template/experience/rio.jpg"
    },
    {
        "id": 3,
        "position": 3,
        "startAt": "10-01-2015",
        "endAt": "11-01-2016",
        "companyName": "Swift Moving",
        "website": "",
        "logo": "assets/template/experience/logo/swift-moving.png",
        "internationalizations": [
            {
                "language": "pt",
                "city": "São Paulo",
                "country": "Brasil",
                "role": "Desenvolvedor Mobile",
                "description": "A <b>Deevo Studio</b> é uma agência especializada em <i>web design</i> e <i>desenvolvimento</i> com um extenso portfólio de casos de sucesso, resultado de mais de <i>20 anos</i> de experiência com diversas agências e no mercado corporativo. Suas criações envolvem tudo, desde o desenvolvimento da marca e identidade visual, até a criação de aplicativos e sites, com um amplo conhecimento do Wordpress e das tecnologias da web. <br><br>Na <i>Deevo Studio</i>, tive a chance de usar o conhecimento anterior de <i>back-end</i> combinado com a experiência prática no desenvolvimento JAVA para aceitar o desafio de iniciar um <i>Departamento de Desenvolvimento Android</i> na empresa, fornecendo complexos <i>Aplicativos Android</i> para empresas no Brasil."
            },
            {
                "language": "en",
                "city": "",
                "country": "United States",
                "role": "Software Engineer",
                "description": "- An early stage startup in the B2B payments space; was fully responsible for all aspects of the technology solution.<br>- Provisioned and administered Linux virtual machines on AWS.<br>- Developed web apps in JavaScript on Node.js and Angular.<br>- Implemented file processing with Python.<br>- Worked on MySQL data modeling, SQL programming, and database administration."
            }
        ],
        "technologies": [
            "Java (Android)", "React.js", "React Native", "Xamarin", "Express.js", "MongoDB", "Google APIs", "C# (.NET)", "SMTP", "Version Control", "BitBucket", "Jira", "Git", "Kanban framework",  "Amazon Web Services (AWS)", "Relational Database Services (RDS)", "MySQL", "Node.js", "Python", "BigQuery", "Spark", "Hadoop", "Angular", "Microsoft SQL Server"
        ],
        "medias": [],
        "medias1": [
            {
                "icon": "linkedin",
                "title": "LinkedIn Deevo Studio",
                "http": "https://www.linkedin.com/company/deevo/about/"
            }
        ],
        "backgroundUrl": "assets/template/experience/sao-paulo.jpg"
    },
    {
        "id": 4,
        "position": 4,
        "startAt": "02-18-2019",
        "endAt": "04-15-2022",
        "companyName": "Bancambios",
        "logo": "assets/template/experience/logo/bancambios-logo.png",
        "internationalizations": [
            {
                "language": "pt",
                "city": "Uberaba",
                "country": "Brasil",
                "role": "Engenheiro de Software",
                "description": "Na <b>QAT Global</b>, eu estava encarregado de ser o <i>Pod Leader</i> de back-end, trabalhando com <i>Big Data Analysis</i> para o maior fornecedor americano de tecnologia de água, que tem negócios em mais de <i>150 países</i>, permitindo que clientes em todo o mundo transportem, tratem, testem e usem água de maneira eficiente em instalações de utilidade pública, residencial, comercial, agrícola e industrial.<br><br>Na <i>QAT Global</i>, assegurei de que todos os desenvolvedores aplicassem as melhores práticas e padrões necessários para um aplicativo corporativo de <i>alta disponibilidade</i>, melhorando não apenas minhas habilidades técnicas, mas também as habilidades interpessoais."
            },
            {
                "language": "en",
                "city": "Uberaba",
                "country": "United States",
                "role": "Software Engeneer",
                "description": "- Successfully implemented 7 backend services and infrastructure to power core blockchain-based products in 8 months. <br>- Built security into new product features to achieve 100% compliance with industry best practices. <br>- Collaborated with external programmers to coordinate the delivery of 6 new software applications. <br>- Maintained customer satisfaction with forward-thinking strategies focused on addressing customer needs and resolving concerns. <br>- Participated in 3 NFT marketplace development projects and was instrumental in their success. <br>- Developed, tested, and deployed a manufacturing executing system (MES) for three large factories in the hydraulic industry. The system included production planning, execution, reporting, warehouse, and shipping. <br>- Led, designed, developed, tested, and deployed as a project leader an overall equipment effectiveness (OEE) monitoring system for monitoring the performance of the machine park in a factory in the automotive industry. "
            }
        ],
        "technologies": [
            "Java", "Spring Boot", "Angular", "Typescript", "Javascript", "SDX", "Versioning Control", "DevOps", "CI/CD", "JUnit", "Karma", "Jasmine", "Selenium", "Jenkins", "Docker", "NPM", "Gradle", "Jira", "Flutter", "Electron", "Django", "Selenium", "Ruby on Rails", "Liquid", "Spring Boot", "Javascript", "Angular", "NoSQL", "MongoDB", "Integration Tests", "Version Control", "BitBucket", "Git", "Maven", "Scrum", "Shopify", "Wordpress"
        ],
        "medias": [],
        "medias1": [
            {
                "icon": "linkedin",
                "title": "LinkedIn QAT Global",
                "http": "https://www.linkedin.com/company/qat/"
            },
            {
                "icon": "facebook",
                "title": "Facebook QAT Global",
                "http": "https://www.facebook.com/QATGlobal/"
            },
            {
                "icon": "youtube",
                "title": "QAT Gobal Youtube",
                "http": "https://www.youtube.com/c/QatGlobal-USA"
            }
        ],
        "backgroundUrl": "assets/template/experience/uberaba.jpg"
    },
    {
        "id": 5,
        "position": 5,
        "startAt": "03-01-2021",
        "companyName": "Bilbo",
        "logo": "assets/template/experience/logo/bilbo.png",
        "internationalizations": [
            {
                "language": "pt",
                "city": "Rotterdão",
                "country": "Países Baixos",
                "role": "Engenheiro Full-stack",
                "description": "<b>Swisscom</b> é a empresa <b>#1</b> de telecomunicações e uma das principais empresas de TI da Suíça. Seus produtos e serviços variam de soluções B2C, como a Swisscom TV, a soluções de TI B2B em vários setores, como Bancos, Saúde, Energia, Entretenimento e Publicidade.<br><br>Na <i>Swisscom DevOps Center</i>, inovação e experimentação estão profundamente enraizadas no DNA da empresa. O ambiente multicultural com 15 nacionalidades, somado à cultura de <i>Tribos/Esquadrões</i>, contribui para colocar nós, funcionários, como parte de uma equipe virtual internacional, especializada em DevOps, entre várias outras tecnologias de ponta."
            },
            {
                "language": "en",
                "city": "",
                "country": "United States",
                "role": "Tech Lead | Full-Stack Developer",
                "description": "- Led the development team under three different workstreams. <br>- Developed microservices, APIs, and micro frontends for enterprise-level applications. <br>- Designed and developed core business functionalities for a US-based real estates corporation. <br>- Created and maintained more than 20 applications with ES6+, React.js, Angular, Vue.js, Node.js, Web3 and mobile development technologies. <br>- Focused on CMS development such as Shopify and WordPress."
            }
        ],
        "technologies": [
            ".NET", "C#", "Azure", "TypeScript", "React", "Angular", "Vue.js", "Node.js", "Web3", "Microservices", "Micro Frontends", "Docker", "Microsoft SQL Server", "Kubernetes", "Kafka", "Shopify", "WordPress", "Low-Code Builder", "Ruby"
        ],
        "medias":[],
        "medias1": [
            {
                "icon": "linkedin",
                "title": "LinkedIn Swisscom",
                "http": "https://www.linkedin.com/company/swisscom/"
            },
            {
                "icon": "facebook",
                "title": "Facebook Swisscom",
                "http": "https://www.facebook.com/Swisscom"
            },
            {
                "icon": "youtube",
                "title": "Youtube Swisscom",
                "http": "https://www.youtube.com/swisscom"
            }
        ],
        "backgroundUrl": "assets/template/experience/rotterdam.jpg"
    }
]
